alpha-blog/app/controllers/articles_controller.rb

    def create
        # render plain: params[:article]
        @article = Article.new(params.require(:article).permit(:title, :description))
        # byebug
        # render plain: @article.inspect
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "heloo janix "], ["description", "double janisss"], ["created_at", "2020-12-01 14:46:17.256631"], ["updated_at", "2020-12-01 14:46:17.256631"]]

    def update
        @article = Article.find(params[:id])
        if @article.update(params.require(:article).permit(:title, :description))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "nicu update"], ["description", "update - nicuuuuuuuuu description"], ["updated_at", "2020-12-02 11:14:23.189565"], ["id", 1]]